OpenFOAM/ERCOFTAC-SIG15/case04.5/Allrun.pre
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

if [ -d constant/polyMesh.orig ]
then
    rm -f constant/polyMesh
    cp -a constant/polyMesh.orig/* constant/polyMesh
elif [ -f system/blockMeshDict ]
then
    runApplication blockMesh
fi
runApplication checkMesh -constant 
